<?php
class R {
	public static $titles = array(
		'外交部：美方未拿出所谓中方网络攻击证据',
		'习近平赴芦山看望受灾民众：非常牵挂大家',
		'甘肃永昌69人因不明原因致急性肠胃炎',
		'辽宁鞍山客车相撞事故已致4人死亡',
		'深圳男官员在台猥亵男服务生后付费和解',
		'习近平看望灾区学生：不要让下一代受到伤害',
		'辽宁鞍海公路两辆客车迎面相撞致多人死伤',
		'习近平赴芦山看望受灾民众：非常牵挂大家',
		'刘云山：党组织服务群众既需要本钱还需要本领',
		'湖北远安工地发生塔吊倾覆事故致5人死亡(图)',
		'外交部证实朝方未获赎金 要求此类事件不再发生',
		'湖南称3家涉镉超标大米企业证照齐全',
		'外交部证实朝方未获赎金 要求其不再扣押我渔民',
		'网贴称温州苍南村民下跪抗议强拆被殴打',
		'长沙女孩坠落下水道2月后遗体在岳阳发现',
		'上海市民高空乱抛垃圾致轻轨列车跳闸停运',
		'广东市长治污不力将被一票否决',
		'日本拟抽地下水入海抑制反应堆污染水增加',
		'德研究发现空气污染或增儿童患糖尿病风险',
		'金锣污染肉检测结果秘不示人',
		'英媒称儿童居住空气污染较重地区易患糖尿病',
		'上海环保局长称征收排污费与本局福利无关',
	);
	public static $descs = array(
		'作为国内首部以立法形式规范垃圾处理行为的地方性法规《北京市生活垃圾管理条例》昨天正式实施，将极大推动北京市生活垃圾源头减量和分类投放、收集、运输、处理全过程的管理。',
		'日本 日本有家用分类垃圾箱，人们在家就可以轻易地给垃圾分类。同时，扔垃圾还要分日子每户都有统一发的表格，写着可燃垃圾、不可燃垃圾、玻璃、罐头、电池等十余种。如可燃垃圾(包括果皮、菜渣等)是每周一、三、五扔；每周二可扔旧报纸；每月第四个周一可扔不可燃垃圾，如电池等。日本垃圾袋是半透明的，所以扔了什么垃圾一目了然，偷不得懒。',
		'每个英国家庭都有3个垃圾箱：一个黑色，装普通生活垃圾；一个绿色，装花园及厨房的垃圾；一个黑色小箱子，装玻璃瓶、易拉罐等可回收物。社区会安排三辆不同的垃圾车每周一次将其运走。普通生活垃圾主要是填埋，花园及厨房的垃圾用作堆肥；垃圾回收中心则回收42种垃圾，如眼镜、家具等。',
		'瑞典的许多超级市场都设有易拉罐和玻璃瓶自动回收机，顾客喝完饮料将易拉罐和玻璃瓶投入其中，机器便会吐出收据，顾客凭收据可以领取一小笔钱。瑞典的清扫公司由三家民间团体联合组成，该公司给每户居民四种纤维袋，分别盛放可以再利用的废纸、废金属、废玻璃瓶和废纤维。清扫公司利用特制的废弃物回收车每月登门收集一次，对其他垃圾则是每周收一次。此外在公寓、旅馆等公共住宅区，还设有专门的收集装置，用以回收各类废弃物。',
		'芬兰各个城镇的居民区和购物中心，都设有不同颜色的废品分类回收箱。芬兰人外出时习惯将家里积攒起来的旧报纸、空玻璃瓶和旧衣服顺手放到分类回收箱，或直接将垃圾送到赫尔辛基地区3个垃圾处理中心的废品分类回收点。回收点再将金属废品送到金属处理厂回炉，将玻璃瓶送到玻璃厂当原料，将废木料送到热电厂作燃料，而废纸和纸板则被造纸厂再次利用。对于像废油、硫酸、电池和药品等有害垃圾，垃圾管理局每年春、秋两季派专车进行回收，然后送到专门处理有害垃圾的工厂进行特殊焚烧处理，并利用焚烧产生的热能发电。',
		'美国纽约的垃圾分类制度开始于1986年。为便于民众分类，市政府规定，在学校、机关等地，垃圾桶分蓝色和绿色。凡纸类垃圾都应放在蓝色桶中；而瓶子罐头等则放在绿桶里。秋季的落叶和冬季的圣诞树则会在特定季节由专人回收当落叶满地时，市政府就会明确要求居民把落叶装入纸垃圾袋中，按指定时间放在房屋前，由垃圾车收走。',
		'在中国女星在戛纳红毯上乱战的如火如荼的时候，在大洋彼岸的另外一边2013年度美国公告牌颁奖典礼如期在拉斯维加斯举行。典礼之前的红毯秀可谓明星璀璨，众多歌坛大牌前来到场，不同于戛纳的优雅公主风，美国红毯十分重口味：真空、透视，玩儿的就是无敌性感范儿。',
		'拉丁天后 Jennifer Lopez 性感驾到，虽然已经是43的岁数，但无论是身穿还是面容都保养的十分到位，真空礼服美胸一览无遗，这件Zuhair Murad 2013春夏高级定制也让天后再次秀出了引以为豪的翘臀。',
		'新晋歌手Nayer凭借超大号的“开胸”礼服亮相红毯，不管你是同性恋还是异性恋，相信都会把视线移向那两颗硕大的“肉蛋”，久久无法把视线移开。再从时尚的角度来说：本次尝试新奇大胆，黑色手套搭配很到位。',
	);

	public static function getTitle($num = 10) {
		if ($num === 1) {
			return self::$titles[rand(0, count(self::$titles)-1)];
		} else {
			return array_rand(self::$titles, $num);
		}
	}

	public static function getDesc($length = 0) {
		$desc = self::$descs[rand(0, count(self::$descs)-1)];
		if ($length) {
			$desc = mb_strcut($desc, 0, $length, "UTF-8");
		}
		return $desc;
	}

	public static function getTime($format = 'Y-m-d'){
		return date($format, time()-rand(1, 500000));
	}

	public static function appImg($num=''){
		$path = DT_PROJECT_PATH . '/images/app/';
		$url  = DT_PROJECT . 'images/app/';
		if (!$num) {
			return $url . rand(1, File::count($path)).'.jpg';
		} else {
			return $url . $num.'.jpg';
		}
	}

	public static function phoneImg($num='') {
		$path = DT_PROJECT_PATH . '/images/phone/';
		$url  = DT_PROJECT . 'images/phone/';
		if (!$num) {
			return $url.rand(1, File::count($path)).'.jpg';
		} else {
			return $url.$num.'.jpg';
		}
	}

	public static function logoImg($num='') {
		$path = DT_PROJECT_PATH . '/images/logo/';
		$url  = DT_PROJECT . 'images/logo/';
		if (!$num) {
			return $url.rand(1, File::count($path)).'.jpg';
		} else {
			return $url.$num.'.jpg';
		}
	}
}